let TRANSLATION_RU = {
	"title": "Словесные часы by Ragman",

	"menu": {
		"aria-show-menu": "Покажи мне меню",
		"aria-hide-menu": "Скрыть меню",
		"language": {
			"label": "Язык",
			"de": "🇩🇪 Немецкий",
			"en": "🇬🇧 Английский",
			"nl": "🇳🇱 Голландский",
			"es": "🇪🇸 Испанский",
			"it": "🇮🇹 Итальянский",
			"hu": "🇭🇺 Венгерский",
			"ru": "🇷🇺 Pусский"
		}
	},

	"connection-lost": {
		"button": "Соединять",
		"text": "Потерялась связь с часами."
	},

	"colors": {
		"h1": "Цвета",
		"with-background": "С цветом фона"
	},

	"functions": {
		"h1": "Характеристики",
		"mode": {
			"h2": "Режим",
			"wordclock": "Словесные часы",
			"color": "Цвет",
			"seconds": "Секунды",
			"digital-clock": "Цифровые часы",
			"scrollingtext": "Бегущий текст",
			"rainbow": "Радуга",
			"color-change": "Изменение цвета",
			"symbol": "Символ"
		},
		"animation": {
			"h2": "Анимация",
			"type": {
				"label": "Тип"
			},
			"duration": {
				"label": "Временные рамки",
				"short": "короткий",
				"medium": "половина",
				"long": "длинный"
			},
			"color": {
				"label": "Анимация в цветах",
				"off": "Bыключен",
				"words": "Красочные слова",
				"letters": "Красочные буквы"
			},
			"speed": {
				"label": "Скорость"
			},
			"demo": {
				"label": "Демо"
			}
		},
		"settings": {
			"h2": "Настройки",
			"brightness": "Светиться ",
			"scrollingtext": "Бегущий текст",
			"save": "сохранять",
			"speed": "Скорость ",
			"leds": "Количество светодиодов ",
			"position": "Позиция "
		}
	},

	"view": {
		"h1": "Параметры экрана",
		"front": {
			"h2": "Front",
			"text": "Изменения размера массива применяются только при сбросе часов.",
			"variant": "Выбор варианта часов",
			"de-10-11": "🇩🇪 10 × 11",
			"de-10-11-alt": "🇩🇪 10 × 11 Альтернатива",
			"de-10-11-alt-frame": "🇩🇪 10 × 11 Альтернативная рама",
			"de-10-11-vertical": "🇩🇪 10 × 11 Вертикальный",
			"de-10-11-clock": "🇩🇪 10 × 11 Часы",
			"de-10-11-nero": "🇩🇪 10 × 11 Nero",
			"de-10-11-schwaebisch": "🇩🇪 10 × 11 Швабия",
			"de-11-11": "🇩🇪 11 × 11",
			"de-11-11-v2": "🇩🇪 11 × 11 V2",
			"de-11-11-v3": "🇩🇪 11 × 11 (panbachi)",
			"de-22-11-weather": "🇩🇪 10 × 11 Погода",
			"de-16-8": "🇩🇪 16 × 8",
			"de-16-18": "🇩🇪 16 × 18",
			"en-10-11": "🇬🇧 10 × 11",
			"nl-10-11": "🇳🇱 10 × 11",
			"es-10-11": "🇪🇸 10 × 11",
			"it-10-11": "🇮🇹 10 × 11",
			"hu-10-10": "🇭🇺 10 x 10",
			"ch-10-11": "🇨🇭 10 x 11",
			"ro-10-11": "🇷🇴 10 x 11",
			"fr-10-11": "🇫🇷 10 x 11",
			"se-10-11": "🇸🇪 10 × 11",
			"ru-10-11": "🇷🇺 10 × 11",
			"invert-min-dir": "Обратное направление отсчета минут",
			"mirror-vertically": "Переверните часы вертикально",
			"mirror-horizontally": "Переверните часы горизонтально",
			"buildtype": "Тип конструкции",
			"normal": "Каждый светодиод соответствует букве",
			"doubleResM1": "Каждый второй светодиод соответствует букве",
			"doubleRes": "Два светодиода на букву"
		},
		"language": {
			"h2": "Язык",
			"hide-it-is": "„ЧАС, ЧАСA, ЧАСОВ“ скрывать",
			"at-nine-fifteen": "ЧАСОВ 9:15 ...",
			"quarter-past-nine": "четверть десятого",
			"quarter-nine": "четверть десяти",
			"at-nine-twenty": "ЧАСОВ 9:20 ...",
			"twenty-past-nine": "девять и двадцать",
			"at-nine-fourty": "ЧАСОВ 9:40 ...",
			"twenty-before-ten": "от двадцати до десяти",
			"at-nine-fourtyfive-german": "ЧАСОВ 9:45 ...",
			"quarter-to-ten": "восемь сорок пять",
			"three-quarter-ten": "Три четверти десять",
			"quarter-to-ten-english": "без четверти десять",
			"a-quarter-to-ten-english": "без четверти десять"
		},
		"minutes": {
			"h2": "минуты",
			"mode": "Режим визуализации по минутам",
			"off": "Bыключен",
			"normal-4-leds": "Нормальный (4 LEDs)",
			"normal-7-leds": "Нормальный (7 LEDs)",
			"edges": "Углы",
			"in-words": "В словах"
		},
		"seconds": {
			"h2": "Секунды",
			"in-border": "Секунды отображаются в рамке.",
			"off": "Bыключен",
			"point": "Место",
			"sector": "Сектор",
			"revolving-sector": "Оборотный сектор"
		},
		"boot": {
			"h2": "Начинать",
			"help": "Что должно произойти при перезагрузке?",
			"blink-leds": "Пусть светодиоды кратковременно мигнут",
			"iterate-leds": "Пусть все светодиоды пройдут один раз",
			"wifi-symbol": "Показывать значок Wi-Fi во время поиска сети",
			"ip-address": "Показать IP-адрес"
		}
	},

	"settings": {
		"h1": "Настройки",
		"status": {
			"h2": "Состояние",
			"label": "Статус подключения",
			"connect": "Соединять"
		},
		"led-type": {
			"h2": "Тип светодиода",
			"help": "Здесь можно настроить тип используемой светодиодной ленты (WS2812 или SK6812).\n" +
				"В зависимости от производителя используемых полосок SK2812 существует другая версия, в которой цвета отображаются в разном порядке.\n" +
				"Соответственно, здесь можно задать правильную цветовую схему полосы.\n" +
				"G-зеленый/B-синий/R-красный/W-белый",
			"label": "Изменение цветотипа",
			"ws2812-brg": "WS2812 BRG",
			"ws2812-grb": "WS2812 GRB",
			"ws2812-rgb": "WS2812 RGB",
			"ws2812-rbg": "WS2812 RBG",
			"ws2812-bgr": "WS2812 BGR",
			"sk6812-brgw": "SK6812 RGBW",
			"save": "Сохранить настройки"
		},
		"whitetype": {
			"h2": "Тип белого светодиода",
			"in-border": "Настройка типа белого светодиода полосы RGBW",
			"ww": "теплый белый",
			"nw": "Нейтральный белый",
			"cw": "Холодный белый"
		},
		"time-server": {
			"h2": "сервер времени",
			"label": "сервер времени",
			"save": "Сохранить настройки"
		},
		"manual-time": {
			"h2": "Установите время вручную",
			"time": "Время",
			"save": "Сохранить настройки"
		},
		"brightness": {
			"h2": "Светиться",
			"mode": "Режим",
			"automatic": "Автоматически",
			"manual": "Вручную",
			"p100": "100 %",
			"p80": "80 %",
			"p60": "60 %",
			"p40": "40 %",
			"p20": "20 %",
			"off": "Aus",
			"zero-to-six": "0:00 – 5:59",
			"six-to-eight": "6:00 – 7:59",
			"eight-to-twelve": "8:00 – 11:59",
			"twelve-to-sixteen": "12:00 – 15:59",
			"sixteen-to-eighteen": "16:00 – 17:59",
			"eighteen-to-twenty": "18:00 – 19:59",
			"twenty-to-twenty-two": "20:00 – 21:59",
			"twenty-two-to-zero": "22:00 – 23:59",
			"ldr-value": "Текущая яркость фоторезистора (LDR)",
			"value-bright": "Значение «Яркое» (0 – 255)",
			"value-dark": "«Темное» значение (0 – 255)"
		},
		"hostname": {
			"h2": "Имя хоста",
			"label": "Имя хоста",
			"save": "Guardar ajustes"
		},
		"weather": {
			"h2": "Климат",
			"api-key": "OpenWeatherMap API-Ключ",
			"city-id": "OpenWeatherMap Город-ID",
			"save": "Сохранить настройки"
		},
		"wifi": {
			"h2": "WiFi / WLAN",
			"help": "Реконфигурация создает вашу собственную WLAN.\n" +
				"Подключитесь к этому, и тогда можно будет выбрать сеть назначения.",
			"ssid": "Имя WLAN (SSID)",
			"other-wifi": "Другой Wi-Fi",
			"configure": "Настраивать",
			"until-restart": "До перезагрузки",
			"deactivate": "Выключить"
		},
		"restart": {
			"h2": "Перезапуск",
			"reset": "Начать заново",
			"restart": "Сброс к настройкам по умолчанию"
		}
	},

	"smart-home": {
		"h1": "Умный дом",
		"mqtt": {
			"h2": "MQTT",
			"text": "Программное обеспечение Word Clock предлагает возможность управления через интерфейс MQTT. Вы можете интегрировать часы в существующую систему домашнего помощника, чтобы иметь возможность управлять элементарными функциями. Эта функция все еще является экспериментальной и постоянно расширяется.",
			"activate": "Включить MQTT",
			"server": "Адрес сервера",
			"port": "Порт",
			"username": "Имя пользователя",
			"password": "Пароль",
			"client-id": "ID клиента",
			"topic": "Tema",
			"save": "Сохранить настройки",
			"discovery": "Отправить HA Discovery"
		}
	},

	"about": {
		"h1": "О",
		"text-general": "Программное обеспечение этих часов основано на часах из <a href='https://web.archive.org/web/20180422160812/http://www.ulrichradig.de/home/index.php/projekte/wort- uhr-neu'>Ульрих Радиг (Стенд 2019)</a> и я теперь <a href='https://github.com/ESPWortuhr/Wortuhr/graphs/contributors'>от сообщества</a> продолжим разработку <a href='https://github.com/ESPWortuhr/Wortuhr'>GitHub</a>.",
		"text-update": "Можно выполнить обновление ПО, сделайте это. <a href='update' onmouseover='javascript:event.target.port=81'>Перейти на страницу обновления</a>.",
		"text-license": "Этот проект имеет открытый исходный код и распространяется по <span lang='en'>3-пунктной лицензии BSD.</span>.",
		"software": "Библиотеки и программное обеспечение",
		"debug": "Отладочный вывод"
	},
	"footer": {
		"version": "Версия"
	}
};
